; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Robot pick crouch place domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain PICKCROUCHPLACE)
  (:requirements :strips :typing)
  (:types place block)
  (:predicates (robot-at ?p - place)
	       (robot-holding ?b - block)
	       (block-at ?b - block ?p - place)
	       (hand-empty)
	       (hand-tucked)
	       (crouched)
	       )

  (:action move
	     :parameters (?from - place ?to - place)
	     :precondition (and (robot-at ?from) (hand-tucked) (crouched))
	     :effect
	     (and (robot-at ?to) (not (robot-at ?from)))
	     )

  (:action tuck
         :parameters ()
	     :precondition (and)
	     :effect
	     (and (hand-tucked) (crouched))
	     )

  (:action crouch
         :parameters ()
	     :precondition (and)
	     :effect
	     (crouched)
	     )

  (:action pick-up
	     :parameters (?b - block ?loc - place)
	     :precondition (and (block-at ?b ?loc) (robot-at ?loc) (hand-empty))
	     :effect
	     (and (not (hand-empty)) (not (block-at ?b ?loc)) (robot-holding ?b))
	     )

  (:action put-down
        :parameters (?b - block ?loc - place)
        :precondition (and (robot-holding ?b) (robot-at ?loc))
        :effect (and (hand-empty) (not (robot-holding ?b)) (block-at ?b ?loc))
        )
)

; problem
(define (problem ppc-1-2)
(:domain PICKCROUCHPLACE)
(:objects b1 - block p1 p2 - place)
(:INIT (block-at b1 p1) (robot-at p1) (hand-empty))
(:goal (and (block-at b1 p2)))
)

; plan
1. (tuck)
   added: (hand-tucked) (crouched)
   goals met: 0 of 1
2. (pick-up b1 p1)
   deleted: (hand-empty) (block-at b1 p1)
   added: (robot-holding b1)
   goals met: 0 of 1
3. (move p1 p2)
   deleted: (robot-at p1)
   added: (robot-at p2)
   goals met: 0 of 1
4. (put-down b1 p2)
   deleted: (robot-holding b1)
   added: (hand-empty) (block-at b1 p2)
   goals met: 1 of 1
